# Ветка мастер является оглавлением для домашних работ.

# git checkout Sem1Task1 - Задача 1 - Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

# git checkout Sem1Task2 - Задача 2 - Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

# git checkout Sem1Task3 - Задача 3 - Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0
#                                     и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

# git checkout Sem1Task4 - Задача 4 - Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

# git checkout Sem1Task5 - Задача 5 - Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.