# Ветка мастер является оглавлением для домашних работ.

# Семинар 1:
# git checkout Sem1Task1 - Задача 1 - Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

# git checkout Sem1Task2 - Задача 2 - Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

# git checkout Sem1Task3 - Задача 3 - Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0
#                                     и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

# git checkout Sem1Task4 - Задача 4 - Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

# git checkout Sem1Task5 - Задача 5 - Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

# Семинар 2:
# git checkout Sem2Task1 - Задача 1 -  Для натурального n создать словарь индекс-значение, состоящий из элементов последовательности 3n + 1.

# git checkout Sem2Task2 - Задача 2 - Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.

# git checkout Sem2Task3 - Задача 3 - Задайте список из n чисел последовательности (1+ (1/n))^n и выведите на экран их сумму.
                           
# git checkout Sem2Task4 - Задача 4 - Задайте число N и создайте список, заполненный числами из промежутка [-N, N]. Найдите произведение элементов на указанных позициях. Позиции хранятся в файле file.txt в одной строке одно число.

# git checkout Sem2Task5 - Задача 5 - Реализуйте алгоритм перемешивания списка.(Без использования библиотеки random)
